[
  
  {
    "project": "televale",
    "name": "Televale - SCADA",
    "desc": "Sistema de Supervisório para Monitoração e Notificação de Emergência em Barragens.",
    "thumb": "TelevaleThumb.png",
    "fullDesc": "O Sistema de Alerta Sonoro com sirenes foi desenvolvido com o objetivo de proteger e salvar vidas através da comunicação em massa da população potencialmente afetada na área de rompimento de uma barragem, por meio de sirenes de longo alcance ou desempenho. Estes conjuntos sonoros podem ser utilizados em usinas hidrelétricas, mineradoras, e também em áreas de enchentes. A partir disso, desenvolvi um <b>Sistema de Supervisório</b> para Monitoração e Notificação de Emergência em Barragens utilizando o Elipse E3.",
    "images": [
      {
        "src": "televale/001.jpg",
        "desc": "Tela de Login"
      },
      {
        "src": "televale/002.jpg",
        "desc": "Visão Geral - Usuário Adm Televale"
      },
      {
        "src": "televale/003.jpg",
        "desc": "Visão Geral - Usuário Operador Cliente"
      },
      {
        "src": "televale/004.jpg",
        "desc": "Visão Geral de uma USINA"
      },
      {
        "src": "televale/005.jpg",
        "desc": "Visão Geral de outra USINA + popups de informações específicas dos equipamentos"
      },
      {
        "src": "televale/006.jpg",
        "desc": "Tela Web de Mapa de uma Usina com Zona inundável e informações de equipamentos e população"
      },
      {
        "src": "televale/007.jpg",
        "desc": "Telde de relatório de alarmes - Usuário Adm"
      },
      {
        "src": "televale/008.jpg",
        "desc": "Telde de relatório de eventos - Usuário Adm"
      }
    ],
    "preview": {
      "link": "",
      "notAvailable": "Não disponível"
    },
    "github": [
      {
        "link": "",
        "notAvailable": "Não disponível",
        "label": ""
      }
    ],
    "stack": ["E3 Studio", "E3 Server", "E3 Viewer", "MQTT", "AWS - Lightsail", "AWS - EC2", "PostgreSQL", "Node.js", "HTML"]
  },
  {
    "project": "fcee",
    "name": "FCEE - Web",
    "desc": "Backend para um sistema de solicitações processos.",
    "thumb": "FceeThumb.png",
    "fullDesc": "Desenvolvi o <b>backend</b> desse projeto solicitado pela <b>Fundação Catarinense de Educação Especial.</b> O Layout foi idealizado a comunicação visual já existente dentro das outras plataformas/sites da FCEE, e o frontend foi desenvolvido por um parceiro. A aplicação consiste em um sistema de solicitação de serviços junto a administração e setores dentro da instituição. <p>O objetivo desse sistema é informatizar/agilizar os processos de solicitações dentro da instituição, tendo como diferencial a geração de relatórios sobre as solicitações realizadas. O sistema conta com 9 papéis + administrador global - cada um com suas peculiaridades na forma de visualizar e utilizar a plataforma.</p>",
    "images": [
      {
        "src": "fcee/0001.jpg",
        "desc": "Tela de Login"
      },
      {
        "src": "fcee/0002.jpg",
        "desc": "Visão de administrador do Sistema"
      },
      {
        "src": "fcee/0003.jpg",
        "desc": "Visão de administrador do Sistema - Tela de gerenciamento de usuários"
      },
      {
        "src": "fcee/0004.jpg",
        "desc": "Visão de administrador do Sistema - Tela de importar usuários"
      },
      {
        "src": "fcee/0005.jpg",
        "desc": "Visão de administrador do Sistema - Tela de Relatórios de Solicitações"
      },
      {
        "src": "fcee/0006.jpg",
        "desc": "Visão de funcionário comum - 9 tipos de solicitações possíveis"
      },
      {
        "src": "fcee/0007.jpg",
        "desc": "Visão de funcionário comum - Tela Minhas Solicitações"
      },
      {
        "src": "fcee/0008.jpg",
        "desc": "Visão de funcionário comum - Tela Solicitação de Material de Consumo"
      },
      {
        "src": "fcee/0009.jpg",
        "desc": "Visão de responsável pelos Materiais de Consumo - Solicitações Pendentes"
      },
      {
        "src": "fcee/0010.jpg",
        "desc": "Visão de responsável pelos Materiais de Consumo - Gerenciar Materiais Disponíveis"
      }
    ],
    "preview": {
      "link": "https://youtu.be/EjN8liNvCjI",
      "notAvailable": ""
    },
    "github": [
      {
        "link": "",
        "notAvailable": "Não disponível",
        "label": "Banckend"
      }
    ],
    "stack": ["Express", "NodeJS", "Mocha e Chai", "REST", "MongoDB"]
  },
  {
    "project": "polvo",
    "name": "Polvo - Web",
    "desc": "Backend para um sistema de apoio a apredizagem da ESAG-UDESC.",
    "thumb": "PolvoThumb.png",
    "fullDesc": "Esse foi meu <b>primeiro projeto web concluido</b>, ainda como estagiário, fazia pouco tempo que tinha iniciado minha jornada com o backend. Foi um projeto <b>bem extenso</b>, tive que sair do frontend e <b>assumir o backend sozinho</b> enquanto o resto equipe ficava no frontend.<p>O projeto POLVO se trata de uma plataforma conhecido como AVA, ou seja, Ambiente Virtual de Aprendizagem, com proposta parecida ao Moodle, que é amplamente utilizado em várias universidades. Já existe uma versão antiga do Polvo, rodando para os alunos da ESAG da Universidade Estadual de Santa Catarina. <b>Esse projeto do qual participei se trata da atualização de interface e funcionalidades.</b> O Polvo possuis funcões como: drive; mala direta; gerenciamento de: usuários, entidades, papéis; realização de provas; postagem de trabalhos colaborativos; postagem de material de apoio, entre outras.</p>",
    "images": [
      {
        "src": "polvo/0001.jpg",
        "desc": "Tela de Login"
      },
      {
        "src": "polvo/0002.jpg",
        "desc": "Visão de administrador do Sistema - Tela do seu DRIVE"
      },
      {
        "src": "polvo/0003.jpg",
        "desc": "Visão de administrador do Sistema - Gerenciar Entidades do Sistema"
      },
      {
        "src": "polvo/0004.jpg",
        "desc": "Visão de administrador do Sistema - Tela de gerenciamento de usuários"
      },
      {
        "src": "polvo/0005.jpg",
        "desc": "Visão do professor - Tela de Material de Apoio"
      },
      {
        "src": "polvo/0006.jpg",
        "desc": "Visão do professor - Tela de Trabalho Colaborativo"
      },
      {
        "src": "polvo/0007.jpg",
        "desc": "Visão do professor - Tela de Avaliações"
      },
      {
        "src": "polvo/0008.jpg",
        "desc": "Visão do professor - Tela de visualização das avaliações submetidas"
      },
      {
        "src": "polvo/0009.jpg",
        "desc": "Visão do aluno - Realizando prova"
      },
      {
        "src": "polvo/0010.jpg",
        "desc": "Visão do aluno - Mala Direta (Mensagens)"
      },
      {
        "src": "polvo/0011.jpg",
        "desc": "Visão do aluno - Enviando nova mensagem via Mala Direta"
      }
    ],
    "preview": {
      "link": "https://youtu.be/WI02lbIfatM",
      "notAvailable": ""
    },
    "github": [
      {
        "link": "",
        "notAvailable": "Não disponível",
        "label": "Banckend"
      }
    ],
    "stack": ["Express", "NodeJS", "Mocha e Chai", "REST", "Socket.io", "MongoDB"]
  },
  {
    "project": "gaviaoreal",
    "name": "Gavião Real - SCADA",
    "desc": "Sistema Supervisório Integrado para Subestação de Gavião Real: Eficiência e Controle Avançados na Rede de Transmissão ENGIE.",
    "thumb": "GaviaoRealThumb.jpg",
    "fullDesc": "Este projeto consistiu na implementação de um <b>Sistema Supervisório</b> para a <b>subestação de Gavião Real</b>, integrando-se às linhas de transmissão de alta tensão da <b>ENGIE</b>. Desenvolvido como uma extensão das soluções já existentes, o sistema utiliza o protocolo de comunicação <b>DNP3</b> e foi construído na plataforma Elipse Power. Com foco em <b>monitoramento remoto e controle operacional</b>, o projeto passou por fases de desenvolvimento, testes de fábrica e está agora prestes a iniciar os <b>testes de aceitação de campo</b> (TAC), visando energizar a subestação no início de abril de 2024. O sistema oferece eficiência operacional, integração padronizada com outros sistemas da ENGIE, confiabilidade na comunicação e segurança nas operações..",
    "images": [
      {
        "src": "gaviaoreal/001.png",
        "desc": "Tela de Login"
      },
      {
        "src": "gaviaoreal/002.png",
        "desc": "Visão Geral - Com Subestação da Gavião Real (GR) ainda deslocada (será ajustado no TAC)"
      },
      {
        "src": "gaviaoreal/003.png",
        "desc": "Visão Geral dos equipamentos da subestação"
      },
      {
        "src": "gaviaoreal/004.png",
        "desc": "Popups de monitoração e operação"
      },
      {
        "src": "gaviaoreal/005.png",
        "desc": "Popup de comando e pré-condições de comando de um disjutor"
      }
    ],
    "preview": {
      "link": "",
      "notAvailable": "Não disponível"
    },
    "github": [
      {
        "link": "",
        "notAvailable": "Não disponível",
        "label": ""
      }
    ],
    "stack": ["Elipse Power", "DNP3", "AVR", "SPS", "MySQL"]
  }
]
